Revit 2027 API
GeometryObject.IsElementGeometry Property
Indicates whether this geometry is obtained directly from an Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementGeometry { get; }
Public ReadOnly Property IsElementGeometry As Boolean
	Get
public:
property bool IsElementGeometry {
	bool get ();
}
member IsElementGeometry : bool with get
Property Value
Boolean
See Also
Reference
GeometryObject Class
Autodesk.Revit.DB Namespace